Repository: KoBeWi/Hedgewars-Theme-Editor-3
Catalog: Translation/*.po
Languages: pl

source: Visible
pl: Widoczne

source: Buried
pl: Zakopane

source: Anchor
pl: Kotwica

source: Overlay
pl: Nakładka

source: Apply changes
pl: Zatwierdź

source: Help
pl: Pomoc

source: Revert
pl: Odrzuć

source: LMB - draw rectangle
pl: LPM - rysuj prostokąt

source: RMB - delete rectangle
pl: PPM - usuń prostokąt

source: MMB - pan view
pl: ŚPM - przesuń widok

source: Mouse wheel - zoom in/zoom out
pl: Kółko myszki - przybliż/oddal

source: Magenta rectangles are intersecting visible and buried rectangles.
pl: Różowe prostokąty są nachodzącymi na siebie odkrytymi i przykrytymi prostokątami.

source: This MUSTN'T happen.
pl: To NIE MOŻE się stać.

source: Discard changes?
pl: Odrzucić zmiany?

source: Select image
pl: Wybierz obrazek

source: If a color is disabled, related key will not appear in theme.cfg
pl: Jeśli kolor jest wyłączony, odpowiedni klucz nie pojawi się w theme.cfg

source: Sky color
pl: Kolor nieba

source: Border/Mudgun color
pl: Kolor krawędzi/miotacza błota

source: Upper water color
pl: Górny kolor wody

source: Lower water color
pl: Dolny kolor wody

source: Sudden Death upper water color
pl: Górny kolor wody Nagłej Śmierci

source: Sudden Death lower water color
pl: Dolny kolor wody Nagłej Śmierci

source: Sudden Death lower sky/horizon tint
pl: Odcień nieba/horyzontu Nagłej Śmierci

source: Sprays
pl: Spray'e

source: Unused images
pl: Nieużyte obrazki

source: Objects
pl: Obiekty

source: Customized theme images
pl: Dostosowane obrazki motywu

source: List of images you can customize in your theme. You have to do so manually in preferred image-editing program.
pl: Lista obrazków, które możesz dostosować w swoim motywie. Musisz to zrobić ręcznie, w preferowanym edytorze grafiki.

source: Hedgewars Theme Editor 3
pl: Edytor Motywów Hedgewars 3

source: Editor settings
pl: Ustawienia edytora

source: Game path
pl: Ścieżka gry

source: User path
pl: Ścieżka użytkownika

source: Misc
pl: Różne

source: Maximize on start
pl: Maksymalizuj na starcie

source: Preferred language
pl: Preferowany język

source: Themes
pl: Motywy

source: Pack themes
pl: Spakuj motywy

source: Create pack
pl: Stwórz paczkę

source: Cancel
pl: Anuluj

source: Enter package name
pl: Wprowadź nazwę paczki

source: Include custom music
pl: Dołącz własną muzykę

source: Save theme
pl: Zapisz motyw

source: Version
pl: Wersja

source: Use 0 to disable versioning
pl: Użyj 0, by wyłączyć wersjonowanie

source: Enable autosave
pl: Włącz autozapis

source: Open theme directory
pl: Otwórz folder motywu

source: Select theme
pl: Wybierz motyw

source: New theme
pl: Nowy motyw

source: Select themes to pack
pl: Wybierz motywy do spakowania

source: Enter name
pl: Wprowadź nazwę

source: Auto-Refresh on theme change.
pl: Autoodświeżanie przy zmianie motywu.

source: Reset Preview
pl: Zresetuj podgląd

source: Click the preview area to lock mouse and control camera.
pl: Kliknij obszar podglądu, by zablokować myszkę i kontrolować kamerę.

source: Theme name
pl: Nazwa motywu

source: Music
pl: Muzyka

source: Music that plays before Sudden Death
pl: Muzyka grająca przed Nagłą Śmiercią

source: Sudden Death Music
pl: Muzyka Nagłej Śmierci

source: Music that plays in Sudden Death
pl: Muzyka grające podczas Nagłej Śmierci

source: Fallback Music
pl: Awaryjna muzyka

source: Music that plays if default music file is missing
pl: Muzyka grająca, gdy brakuje pliku domyślnej muzyki

source: Fallback Sudden Death Music
pl: Awaryjna muzyka Nagłej Śmierci

source: Music that plays in Sudden Death if default music file is missing
pl: Muzyka grająca podczas Nagłej Śmierci, gdy brakuje pliku domyślnej muzyki

source: If a property is disabled, related key will not appear in theme.cfg
pl: Jeśli właściwość jest wyłączona, odpowiedni klucz nie pojawi się w theme.cfg

source: Colors
pl: Kolory

source: Clouds floating atop the map before Sudden Death
pl: Chmury na szczycie mapy przed Nagłą Śmiercią

source: Clouds
pl: Chmury

source: Amount
pl: Ilość

source: Number of clouds to create
pl: Liczba chmur, które się tworzą

source: Clouds floating atop the map during Sudden Death
pl: Chmury na szczycie mapy podczas Nagłej Śmierci

source: Sudden Death Clouds
pl: Chmury Nagłej Śmierci

source: Flakes appearing in the background before Sudden Death
pl: Płatki widoczne w tle przed Nagłą Śmiercią

source: Flakes
pl: Płatki

source: Amount of visible flakes
pl: Liczba widocznych płatków

source: Frames
pl: Klatki

source: Number of frames used in Flake.png
pl: Liczba klatek używanych w pliku Flake.png

source: Frame duration
pl: Długość klatki

source: Rotation speed
pl: Szybkość obracania

source: How fast the flakes rotate. With any value other than 0, flakes will rotate and also spawn with a random rotation
pl: Jak szybko płatki się obracają. Z dowolną wartością różną od 0, płatki będą się obracać oraz pojawiać z losowym obrotem

source: Falling speed
pl: Szybkość spadania

source: Vertical speed of the flakes. A positive value makes the flakes fall, while a negative value makes them rise
pl: Pionowa prędkość płatków. Wartość dodatnia sprawi, że płatki będą spadać, a ujemna, że będą się unosić

source: Flakes appearing in the background during Sudden Death
pl: Płatki widoczne w tle podczas Nagłej Śmierci

source: Sudden Death Flakes
pl: Płatki Nagłej Śmierci

source: Specifies a custom water animation and flowing speed before Sudden Death
pl: Określa własną szybkość animacji i płynięcia wody przed Nagłą Śmiercią

source: Water Animation
pl: Animacja wody

source: Number of frames in BlueWater.png. The frames in this image should be stacked vertically. The height of this image must be divisible by number of frames
pl: Liczba klatek w pliku BlueWater.png. Klatki w tym obrazki powinny być ułożone pionowo. Wysokość tego obrazka musi być podzielna przez liczbę klatek

source: Duration of a single frame. Must be greater than 0 if frames are greater than 1, otherwise it is ignored
pl: Czas trwania jednej klatki. Musi być większy od 0 jeśli klatki są większe od 1, inaczej jest zignorowany

source: Flowing speed
pl: Szybkość płynięcia

source: How fast the water moves to the right. Higher values means faster movement. If negative, it moves to the left. Use 0 to stop movement
pl: Jak szybko woda porusza się w prawo. Większe wartości oznaczają szybszy ruch. Jeśli ujemne, woda porusza się w lewo. Użyj 0, by zatrzymać ruch

source: Specifies a custom water animation and flowing speed in Sudden Death
pl: Określa własną szybkość animacji i płynięcia wody podczas Nagłej Śmierci

source: Sudden Death Water Animation
pl: Animacja wody Nagłej Śmierci

source: Miscellaneous
pl: Różne

source: Rope Step
pl: Krok liny

source: Changes the distance between rope pieces. Use together with RopeNode.png in Customization tab.
pl: Zmienia dystans pomiędzy kawałkami liny. Użyj razem z RopeNode.png w zakładce Dostosowanie.

source: Flags
pl: Flagi

source: If enabled, the theme will be hidden from the in-game theme selection menu
pl: Jeśli włączone, motyw będzie ukryty w menu wyboru motywów w grze

source: Hidden?
pl: Ukryty?

source: If enabled, all flakes have the same size and are on the same layer: In front of the sky and horizont and behind the terrain
pl: Jeśli włączone, wszystkie płatki będą miały ten sam rozmiar i będą na tej samej warstwie: przed niebem i horyzontem, a za terenem

source: Flatten flakes?
pl: Spłaszcz płatki?

source: If enabled, all clouds have the same size and are on the same layer: background
pl: Jeśli włączone, wszystkie chmury będą miały ten sam rozmiar i będą na tej samej warstwie: tle

source: Flatten clouds?
pl: Spłaszcz chmury?

source: If enabled, when flakes collide with terrain, they become a part of the landscape. Use Snow.png to change the appearance of the snow
pl: Jeśli włączone, kiedy płatki kolidują z terenem, stają się częścią krajobrazu. Użyj Snow.png, żeby zmienić wygląd śniegu

source: Snow?
pl: Śnieg?

source: If enabled, girders become slippery like ice. This also applies to placed girders
pl: Jeśli włączone, belki stają się śliskie jak lód. Działa również na stawiane belki

source: Ice?
pl: Lód?

source: Select overlay image
pl: Wybierz obrazek nakładki

source: Customization
pl: Dostosowanie

source: Icon
pl: Ikona

source: Themes without icon don't appear on in-game theme list
pl: Motywy bez ikony nie pojawiają się na liście motywów w grze

source: Size: %s
pl: Rozmiar: %s

source: Land texture
pl: Tekstura lądu

source: Texture drawn as map's terrain
pl: Tekstura rysowana jako teren mapy

source: This image is required
pl: Ten obrazek jest wymagany

source: Any size
pl: Dowolny rozmiar

source: Land back texture
pl: Tylna tekstura lądu

source: Visible when terrain is destroyed
pl: Widoczna, gdy teren jest zniszczony

source: Border
pl: Brzeg

source: Painted arround terrain
pl: Rysowany wokół terenu

source: Two halves, top and bottom %s pix each
pl: Dwie połówki, góra i dół każda %s pikseli

source: Girder
pl: Belka

source: Land bridges
pl: Lądowe mosty

source: If not provided, a default image is used
pl: Jeśli nie dodano, domyślny obrazek jest użyty

source: Chunk
pl: Odłamek

source: Particles that fall when land is destroyed
pl: Odłamki, które spadają, gdy ląd jest niszczony

source: If not provided, no particles will appear
pl: Jeśli nie dodano, żadne odłamki nie spadną

source: Each particle is %s square
pl: Każdy odłamek to kwadrat %s

source: Dust
pl: Kurz

source: Particles that fall when something hits ground or mudball flies etc.
pl: Cząsteczki, które spadają, gdy coś uderzy w ziemię albo leci kula błota itp.

source: Water
pl: Woda

source: Texture of water waves
pl: Tekstura wodnych fal

source: SD version is used during Sudden Death
pl: Wersja SD jest używana podczas Nagłej Śmierci

source: %s is preferred
pl: %s preferowane

source: Splash and droplets
pl: Plusk i krople

source: Used when something hits water
pl: Używane, gdy coś uderzy w wodę

source: Size: %s frames %s pix each
pl: Rozmiar: %s klatek, każda %s pikseli

source: Lined vertically in two columns
pl: Ułożone pionowo w dwóch kolumnach

source: Size: %s images %s pix each
pl: Rozmiar: %s klatek, każda %s pikseli

source: Lined vertically
pl: Ułożone pionowo

source: Texture for clouds that appear on top of the map
pl: Tekstura dla chmur, które latają na górze mapy

source: Size: %s for each cloud
pl: Rozmiar: każda chmura %s

source: Any number
pl: Dowolna ilość

source: Texture for flakes that float in background
pl: Tekstura dla płatków, które unoszą się w tle

source: Size: %s for each flake
pl: Rozmiar: każdy płatek %s

source: Game will crash if flakes are enabled and this image is missing
pl: Gra się crashuje, jeśli płatki są włączone, a brakuje tego obrazka

source: Mirrored clouds/flakes
pl: Odwrócone chmury/płatki

source: Will replace their equivalents when wind is blowing left
pl: Podmienią swoje odpowiedniki kiedy wiatr wieje w lewo

source: If not provided, flakes/clouds will always appear in one direction
pl: Jeśli nie dodano, płatki/chmury zawsze będą ustawione w jednym kierunku

source: Snow
pl: Śnieg

source: Texture for snow that accumulates on map when snow is enabled
pl: Tekstura dla śniegu, który zbiera się na mapach, kiedy śnieg jest włączony

source: Must be at least 2 pixels wide to appear
pl: Musi mieć co najmniej 2 piksele szerokości, by się pojawić

source: Height lower than 2 pixels will crash the game
pl: Wysokość mniejsza niż 2 piksele spowoduje crash gry

source: Sky
pl: Niebo

source: Map's background texture
pl: Tekstura tła mapy

source: If not provided, no sky will appear
pl: Jeśli nie dodano, niebo nie będzie widoczne

source: Standard height is 512
pl: Standardowa wysokość to 512

source: Left/right sky
pl: Lewe/prawe niebo

source: If SkyL exists, Sky will be centered and SkyL will be looped on both sides
pl: Jeśli SkyL istnieje, Sky będzie wyśrodkowane, a SkyL będzie zapętlone w obie strony

source: If both SkyL and SkyR exist, Sky will be centered, SkyL will be looped on left side and SkyR on right side
pl: Jeśli SkyL i SkyR istnieją oba, Sky będzie wyśrodkowane, a SkyL będzie zapętlone w po lewej stronie i SkyR po prawej

source: Height preferrably the same as %s
pl: Preferowana wysokość ta sama jak dla %s

source: Horizont
pl: Horyzont

source: Background layer between sky and terrain
pl: Warstwa tła pomiędzy niebem, a terenem

source: If not provided, no horizont will appear
pl: Jeśli nie dodano, horyzont nie będzie widoczny

source: Left/right horizont
pl: Lewy/prawy horyzont

source: Same as SkyL/SkyR, but for horizont
pl: To samo co SkyL/SkyR, ale dla horyzontu

source: Girder tool
pl: Narzędzie belki

source: Used as a replacement for girder tool
pl: Użyte jako zamiennik dla narzędzia belki

source: Any shape is allowed and will have proper collisions
pl: Każdy kształt jest dozwolony i będzie miał odpowiednie kolizje

source: Use template if you want proper layout
pl: Użyj szablonu, jeśli chcesz prawidłowy układ

source: %s grid of images
pl: Siatka obrazków %s

source: Each image is %s pix
pl: Każdy obrazek ma %s pikseli

source: Rubber tool
pl: Narzędzie gumy

source: Used as a replacement for rubber tool
pl: Użyte jako zamiennik dla narzędzia gumy

source: Mudball weapon
pl: Kula błota

source: Used as a replacement for mudball weapon
pl: Użyte jako zamiennik dla broni kula błota

source: Rope
pl: Lina

source: Replaces piece of rope. Use together with Rope Step in Theme tab.
pl: Podmienia kawałek liny. Użyj razem z Krokiem Liny w zakładce Motyw.

source: Main
pl: Ekran główny

source: LANGUAGE_NAME
pl: Polski

source: Theme
pl: Motyw

source: /none/
pl: /brak/

source: Fetch template
pl: Weź szablon

source: Number per map
pl: Ilość na mapę

source: Placed on water
pl: Stawiaj na wodzie

source: Edit this object
pl: Edytuj ten obiekt

source: overlay
pl: nakładka
